class Translation(object):
    START_TEXT = """ʜɪ {},ɪ'ᴍ ᴜʀʟ ᴜᴘʟᴏᴀᴅᴇʀ ᴅᴄ ʙᴏᴛ!

ʏᴏᴜ ᴄᴀɴ ᴜᴘʟᴏᴀᴅ ʜᴛᴛᴘ/ʜᴛᴛᴘꜱ ᴅɪʀᴇᴄᴛ ʟɪɴᴋ, ᴜꜱɪɴɢ ᴛʜɪꜱ ʙᴏᴛ! /Help ꜰᴏʀ ᴍᴏʀᴇ ᴅᴇᴛᴀɪʟꜱ!

〽️ ᴘᴏᴡᴇʀᴇᴅ ʙʏ @GroupDcBots"""
    FORMAT_SELECTION = "ꜱᴇʟᴇᴄᴛ ᴛʜᴇ ᴅᴇꜱɪʀᴇᴅ ꜰᴏʀᴍᴀᴛ: <ᴀ ʜʀᴇꜰ='{}'>ꜰɪʟᴇ ꜱɪᴢᴇ ᴍɪɢʜᴛ ʙᴇ ᴀᴘᴘʀᴏxɪᴍᴀᴛᴇ \ɴɪꜰ ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ ꜱᴇᴛ ᴄᴜꜱᴛᴏᴍ ᴛʜᴜᴍʙɴᴀɪʟ, ꜱᴇɴᴅ ᴘʜᴏᴛᴏ ʙᴇꜰᴏʀᴇ ᴏʀ Qᴜɪᴄᴋʟʏ ᴀꜰᴛᴇʀ ᴛᴀᴘᴘɪɴɢ ᴏɴ ᴀɴʏ ᴏꜰ ᴛʜᴇ ʙᴇʟᴏᴡ ʙᴜᴛᴛᴏɴꜱ.\ɴʏᴏᴜ ᴄᴀɴ ᴜꜱᴇ /ᴅᴇʟᴇᴛᴇᴛʜᴜᴍʙɴᴀɪʟ ᴛᴏ ᴅᴇʟᴇᴛᴇ ᴛʜᴇ ᴀᴜᴛᴏ-ɢᴇɴᴇʀᴀᴛᴇᴅ ᴛʜᴜᴍʙɴᴀɪʟ."
    SET_CUSTOM_USERNAME_PASSWORD = """ɪꜰ ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ ᴅᴏᴡɴʟᴏᴀᴅ ᴘʀᴇᴍɪᴜᴍ ᴠɪᴅᴇᴏꜱ, ᴘʀᴏᴠɪᴅᴇ ɪɴ ᴛʜᴇ ꜰᴏʟʟᴏᴡɪɴɢ ꜰᴏʀᴍᴀᴛ: ᴜʀʟ | ꜰɪʟᴇɴᴀᴍᴇ | ᴜꜱᴇʀɴᴀᴍᴇ | ᴘᴀꜱꜱᴡᴏʀᴅ"""
    DOWNLOAD_START = "📥 ᴅᴏᴡɴʟᴏᴀᴅɪɴɢ..."
    UPLOAD_START = "📤 ᴜᴘʟᴏᴀᴅɪɴɢ..."
    RCHD_TG_API_LIMIT = "🚀 Downloaded in {} seconds.\nDetected File Size: {}\nSorry. But, I cannot upload files greater than 2GB due to Telegram API limitations."
    AFTER_SUCCESSFUL_UPLOAD_MSG = "🚀 ᴛʜᴀɴᴋs ғᴏʀ ᴜsɪɴɢ ᴍᴇ \ɴ\ɴ<ʙ>ᴊᴏɪɴ @ɢʀᴏᴜᴘᴅᴄʙᴏᴛs ғᴏʀ ᴍᴏʀᴇ ᴜsᴇғᴜʟ ʙᴏᴛs ʟɪᴋᴇ ᴍᴇ💟</b>"
    AFTER_SUCCESSFUL_UPLOAD_MSG_WITH_TS = "🚀 ᴅᴏᴡɴʟᴏᴀᴅɪɴɢ in {} seconds.\n🚀 ᴜᴘʟᴏᴀᴅɪɴɢ in {} seconds.\n\n@Groupdcbots"
    SAVED_CUSTOM_THUMB_NAIL = "ᴄᴜsᴛᴏᴍ ᴠɪᴅᴇᴏ / ғɪʟᴇ ᴛʜᴜᴍʙɴᴀɪʟ sᴀᴠᴇᴅ. ᴛʜɪs ɪᴍᴀɢᴇ ᴡɪʟʟ ʙᴇ ᴜsᴇᴅ ɪɴ ᴛʜᴇ ᴠɪᴅᴇᴏ / ғɪʟᴇ."
    DEL_ETED_CUSTOM_THUMB_NAIL = "✅ ᴄᴜsᴛᴏᴍ ᴛʜᴜᴍʙɴᴀɪʟ ᴄʟᴇᴀʀᴇᴅ sᴜᴄᴄᴇsғᴜʟʟʏ."
    CUSTOM_CAPTION_UL_FILE = "{}"
    NO_VOID_FORMAT_FOUND = "ᴇʀʀᴏʀ...\n<b>ʏᴏᴜᴛᴜʙᴇᴅʟ</b> said: {}"
    ABOUT_MSG = """sᴏᴍᴇᴛʜɪɴɢ ᴀʙᴏᴜᴛ ᴍᴇ :         ☞ᴍʏ ɴᴀᴍᴇ  : ᴜʀʟ ᴜᴘʟᴏᴀᴅᴇʀ ʙᴏᴛ     ☞ᴜᴘᴅᴀᴛᴇs  : @ɢʀᴏᴜᴘᴅᴄʙᴏᴛs         ☞ʟᴀɴɢᴜᴀɢᴇ : ᴘʏᴛʜᴏɴ𝟹     ☞ʟɪʙʀᴀʀʏ  : <ᴀ ʜʀᴇғ="ʜᴛᴛᴘs://ᴅᴏᴄs.ᴘʏʀᴏɢʀᴀᴍ.ᴏʀɢ/">ᴘʏʀᴏɢʀᴀᴍ 𝟷.𝟶.𝟽</a>"""
    HELP_USER = """ᴘʟᴇᴀsᴇ ғᴏʟʟᴏᴡ ᴛʜᴇsᴇ sᴛᴇᴘs!      𝟷. sᴇɴᴅ ᴜʀʟ (ᴇxᴀᴍᴘʟᴇ.ᴅᴏᴍᴀɪɴ/ғɪʟᴇ.ᴍᴘ𝟺 | ɴᴇᴡ ғɪʟᴇɴᴀᴍᴇ.ᴍᴘ𝟺). 𝟸. sᴇɴᴅ ɪᴍᴀɢᴇ ᴀs ᴄᴜsᴛᴏᴍ ᴛʜᴜᴍʙɴᴀɪʟ (ᴏᴘᴛɪᴏɴᴀʟ). 𝟹. sᴇʟᴇᴄᴛ ᴛʜᴇ ʙᴜᴛᴛᴏɴ.    sᴠɪᴅᴇᴏ - ɢɪᴠᴇ ғɪʟᴇ ᴀs ᴠɪᴅᴇᴏ ᴡɪᴛʜ sᴄʀᴇᴇɴsʜᴏᴛs    ᴅғɪʟᴇ  - ɢɪᴠᴇ ғɪʟᴇ (ᴠɪᴅᴇᴏ) ᴀs ғɪʟᴇ ᴡɪᴛʜ sᴄʀᴇᴇɴsʜᴏᴛs    ᴠɪᴅᴇᴏ  - ɢɪᴠᴇ ғɪʟᴇ ᴀs ᴠɪᴅᴇᴏ ᴡɪᴛʜᴏᴜᴛ sᴄʀᴇᴇɴsʜᴏᴛs    ғɪʟᴇ   - ɢɪᴠᴇ ғɪʟᴇ ᴡɪᴛʜᴏᴜᴛ sᴄʀᴇᴇɴsʜᴏᴛs  ɪғ ʙᴏᴛ ᴅɪᴅɴ'ᴛ ʀᴇsᴘᴏɴᴅ, ᴀsᴋ ʜᴇʀᴇ @GroupDcBots"""
    REPLY_TO_MEDIA_ALBUM_TO_GEN_THUMB = "ʀᴇᴘʟʏ /ɢᴇɴᴇʀᴀᴛᴇᴄᴜsᴛᴏᴍᴛʜᴜᴍʙɴᴀɪʟ ᴛᴏ ᴀ ᴍᴇᴅɪᴀ ᴀʟʙᴜᴍ, ᴛᴏ ɢᴇɴᴇʀᴀᴛᴇ ᴄᴜsᴛᴏᴍ ᴛʜᴜᴍʙᴀɪʟ"
    ERR_ONLY_TWO_MEDIA_IN_ALBUM = """ᴍᴇᴅɪᴀ ᴀʟʙᴜᴍ sʜᴏᴜʟᴅ ᴄᴏɴᴛᴀɪɴ ᴏɴʟʏ ᴛᴡᴏ ᴘʜᴏᴛᴏs. ᴘʟᴇᴀsᴇ ʀᴇ-sᴇɴᴅ ᴛʜᴇ ᴍᴇᴅɪᴀ ᴀʟʙᴜᴍ, ᴀɴᴅ ᴛʜᴇɴ ᴛʀʏ ᴀɢᴀɪɴ, ᴏʀ sᴇɴᴅ ᴏɴʟʏ ᴛᴡᴏ ᴘʜᴏᴛᴏs ɪɴ ᴀɴ ᴀʟʙᴜᴍ.ʏᴏᴜ ᴄᴀɴ ᴜsᴇ /ʀᴇɴᴀᴍᴇ ᴄᴏᴍᴍᴀɴᴅ ᴀғᴛᴇʀ ʀᴇᴄᴇɪᴠɪɴɢ ғɪʟᴇ ᴛᴏ ʀᴇɴᴀᴍᴇ ɪᴛ ᴡɪᴛʜ ᴄᴜsᴛᴏᴍ ᴛʜᴜᴍʙɴᴀɪʟ sᴜᴘᴘᴏʀᴛ."""
    CANCEL_STR = "✅ ᴘʀᴏᴄᴇss ᴄᴀɴᴄᴇʟʟᴇᴅ"
    ZIP_UPLOADED_STR = "🚀 ᴜᴘʟᴏᴀᴅᴇᴅ {} files in {} seconds"
    SLOW_URL_DECED = "ɢᴏsʜ ᴛʜᴀᴛ sᴇᴇᴍs ᴛᴏ ʙᴇ ᴀ ᴠᴇʀʏ sʟᴏᴡ ᴜʀʟ. sɪɴᴄᴇ ʏᴏᴜ ᴡᴇʀᴇ sᴄʀᴇᴡɪɴɢ ᴍʏ ʜᴏᴍᴇ, ɪ ᴀᴍ ɪɴ ɴᴏ ᴍᴏᴏᴅ ᴛᴏ ᴅᴏᴡɴʟᴏᴀᴅ ᴛʜɪs ғɪʟᴇ. ᴍᴇᴀɴᴡʜɪʟᴇ, ᴡʜʏ ᴅᴏɴ'ᴛ ʏᴏᴜ ᴛʀʏ ᴛʜɪs:==> ʜᴛᴛᴘ://ғɪʟᴇsᴛʀᴇᴀᴍᴅᴄʙᴏᴛ.ʜᴇʀᴏᴋᴜᴀᴘᴘ.ᴄᴏᴍ/𝟷𝟷𝟿𝟾 ᴀɴᴅ ɢᴇᴛ ᴍᴇ ᴀ ғᴀsᴛ ᴜʀʟ ɪɴ @Dcstreamsbot sᴏ ᴛʜᴀᴛ ɪ ᴄᴀɴ ᴜᴘʟᴏᴀᴅ ᴛᴏ ᴛᴇʟᴇɢʀᴀᴍ, ᴡɪᴛʜᴏᴜᴛ ᴍᴇ sʟᴏᴡɪɴɢ ᴅᴏᴡɴ ғᴏʀ ᴏᴛʜᴇʀ ᴜsᴇʀs."
